Courses/4420/Lectures/SecSoftware/Labs/secsoftware-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-08 Tue 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Software without Security Holes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2019-09-18 | <a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Software without Security Holes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b8e178">1. Overview</a>
<ul>
<li><a href="#orgb8c4ad2">1.1. Prerequisites</a></li>
</ul>
</li>
<li><a href="#orga2e0e78">2. Tasks</a>
<ul>
<li><a href="#org0b5d30b">2.1. Task: Effective Use of Splint [20 points]</a></li>
<li><a href="#orgbbb881f">2.2. Task: Analyze sudo [20 points]</a></li>
<li><a href="#orgf3a75ab">2.3. Task: RATS, Valgrind, and UNO [3 * 10 points]</a></li>
<li><a href="#org5746224">2.4. Task: Code Style [20 points]</a></li>
</ul>
</li>
<li><a href="#org204451c">3. Tasks: [Bonus][Optional]</a>
<ul>
<li><a href="#orgc86a8ab">3.1. Task: sudo Keeps Growing! [20 points]</a></li>
<li><a href="#orgc5885b8">3.2. Task: Improve the man Pages of sudo [20 points]</a></li>
</ul>
</li>
<li><a href="#org68c321e">4. Submission</a></li>
<li><a href="#org505ef30">5. References</a></li>
<li><a href="#org7ee6294">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4b8e178" class="outline-2">
<h2 id="org4b8e178"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Objectives: Introduce you to source code analysis based tools.  Get
you to think about secure programming some more.</li>
</ol>
</div>

<div id="outline-container-orgb8c4ad2" class="outline-3">
<h3 id="orgb8c4ad2"><span class="section-number-3">1.1</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Install <code>sudo apt install splint</code> <a href="https://splint.org/">https://splint.org/</a></li>
<li>Install <code>sudo apt install valgrind</code>  Visit <a href="http://valgrind.org/">http://valgrind.org/</a></li>
<li>Install UNO from <a href="https://github.com/nimble-code/Uno">https://github.com/nimble-code/Uno</a> Visit
<a href="http://spinroot.com/uno/">http://spinroot.com/uno/</a>.  You ought to read this <a href="https://www.researchgate.net/publication/2564922_UNO_Static_Source_Code_Checking_for_UserDefined_Properties/download">PDF</a> also.</li>
<li>Install RATS following <a href="https://security.web.cern.ch/security/recommendations/en/codetools/rats.shtml">link</a></li>
<li>Download the source code of the latest stable release of <code>sudo</code>
from <a href="http://www.sudo.ws/sudo/">http://www.sudo.ws/sudo/</a>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga2e0e78" class="outline-2">
<h2 id="orga2e0e78"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
<p>
Not all tasks are equal in difficulty.  Devote your time wisely on
what interests you most.
</p>
</div>


<div id="outline-container-org0b5d30b" class="outline-3">
<h3 id="org0b5d30b"><span class="section-number-3">2.1</span> Task: Effective Use of Splint [20 points]</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Answer the following questions.  Some of them are answered in the
Splint manual.</li>

<li>Write the two <i>loop invariant assertions</i> for a <a href="https://www.thecrazyprogrammer.com/2013/04/c-program-to-sort-array-by-using-bubble-2.html">sorting program in C</a>,
based on bubble sort.  [Link to <a href="https://algs4.cs.princeton.edu/21elementary/Bubble.java.html">Java program</a> from an excellent
book.]</li>

<li>The C/C++ data type <code>char</code> can be used as an <code>int</code>.  (i) Is it
signed or unsigned?  (ii) Are the types of p and q declared as in
<code>char *p</code> and <code>char q[]</code> the same? (iii) Of the two signatures of
typical main method of C programs shown here, which is to be
preferred and why?
<ol class="org-ol">
<li><code>int main (unsigned int argc, char **argv, char ** envp)</code></li>
<li><code>int main (unsigned int argc, char *argv[], char ** envp)</code></li>
</ol></li>

<li><p>
Explain the meaning (in your own words, not by a cut-n-paste) of
the Splint annotations shown in the following line of C code:
</p>
<pre class="example">
typedef /*@abstract@*/ /*@immutable@*/ int weekDay;

</pre></li>
</ol>
</div>
</div>

<div id="outline-container-orgbbb881f" class="outline-3">
<h3 id="orgbbb881f"><span class="section-number-3">2.2</span> Task: Analyze sudo [20 points]</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Build sudo from its source code.  Read the included man page, not
<code>man sudo</code>.  Check that the newly built sudo "works."  Submit
details of how you checked.</li>

<li>Run <code>splint</code>, with no flags (except for include-related),
collectively on all the source code files of <code>sudo</code>.  Insert all
its messages into the lab report as an <b>appendix</b>.</li>

<li>Select <i>three</i> interesting messages regarding source code errors
generated by splint, and explain the messages and the causes for
their generation.</li>
</ol>
</div>
</div>

<div id="outline-container-orgf3a75ab" class="outline-3">
<h3 id="orgf3a75ab"><span class="section-number-3">2.3</span> Task: RATS, Valgrind, and UNO [3 * 10 points]</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Use each of the tools named RATS, valgrind, and UNO on the source
code files and/or the sudo program built from the above.</li>
<li>Select and discuss five discoveries made by each of the tools.
Total 15 items.</li>
<li>Write a comparative review of the tools.</li>
</ol>
</div>
</div>

<div id="outline-container-org5746224" class="outline-3">
<h3 id="org5746224"><span class="section-number-3">2.4</span> Task: Code Style [20 points]</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Holzmann's paper (see the References of <a href="../SecSoftware">../SecSoftware</a>) presents
"Ten Rules for Writing Safety Critical Code".  One line versions of
these are shown below.
<ol class="org-ol">
<li>Restrict to simple control flow constructs.</li>
<li>Give all loops a fixed upper-bound.</li>
<li>Do not use dynamic memory allocation after initialization.</li>
<li>Limit functions to no more than 60 lines of text.</li>
<li>Use minimally two assertions per function on average.</li>
<li>Declare data objects at the smallest possible level of scope.</li>
<li>Check the return value of non-void functions, and check the
validity of function parameters.</li>
<li>Limit the use of the preprocessor to file inclusion and simple macros.</li>
<li>Limit the use of pointers. Use no more than two levels of
dereferencing per expression.</li>
<li>Compile with all warnings enabled, and use one or more source
code analyzers.</li>
</ol></li>
<li>List all violations of these rules that <code>sudo</code> makes.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org204451c" class="outline-2">
<h2 id="org204451c"><span class="section-number-2">3</span> Tasks: [Bonus][Optional]</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc86a8ab" class="outline-3">
<h3 id="orgc86a8ab"><span class="section-number-3">3.1</span> Task: sudo Keeps Growing! [20 points]</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>For your awareness, the tar ball sizes of a few sudo versions are
shown below. 

<ol class="org-ol">
<li><code>-rw-r--r-- 1 pmateti pmateti 0349785 2003</code> <a href="./sudo-1.6.7p5.tar.gz">sudo-1.6.7p5.tar.gz</a></li>
<li><code>-rw-r--r-- 1 pmateti pmateti 1608969 2012</code> <a href="http://www.sudo.ws/sudo/dist/sudo-1.8.4p4.tar.gz">sudo-1.8.4p4.tar.g</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 2117145 2013</code> <a href="http://www.sudo.ws/sudo/dist/sudo-1.8.8.tar.gz">sudo-1.8.8.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 2976081 2017</code> <a href="https://www.sudo.ws/dist/sudo-1.8.21p2.tar.gz">sudo-1.8.21p2.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 3189951 2018</code> <a href="https://www.sudo.ws/dist/sudo-1.8.25p1.tar.gz">sudo-1.8.25p1.tar.gz</a></li>
<li><code>-rw-rw-r-- 1 pmateti pmateti 3293178 2019</code> <a href="https://www.sudo.ws/dist/sudo-1.8.27.tar.gz">sudo-1.8.27.tar.gz</a></li>
</ol></li>

<li>Summarize what has improved.  Explain the increase in size.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc5885b8" class="outline-3">
<h3 id="orgc5885b8"><span class="section-number-3">3.2</span> Task: Improve the man Pages of sudo [20 points]</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Study the different versions of the man pages of sudo that are in
these tar balls.  Focus on the "seven sins of the specifier",
namely, 1. Noise, 2. Silence: 3. Overspecification, 4. Contradiction, 5. Ambiguity, 6. Forward
Reference, 7. Wishful Thinking (from Bertrand Meyer 1985).  Do you
find that the man pages became better or worse over the years.
Write up your findings.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org68c321e" class="outline-2">
<h2 id="org68c321e"><span class="section-number-2">4</span> Submission</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>[10 points] You must follow the <a href="../Overview/labReports.html">Lab Report Template</a>.  There should be a section
on each of the tasks.  Include a couple of lines of an answer to
each (implied/ explicit) question/ discussion item.</li>
<li>Use good judgement and do not make the report way longer than, say,
20 pages.  Submit explanations and code that verifies your answers.</li>
<li>Submit a PDF file named <b>exactly</b> <code>Report-L3.pdf</code>. (Scripts are
used to check various things &#x2013; so file names should obey such
"rules".)</li>
</ol>
</div>
</div>

<div id="outline-container-org505ef30" class="outline-2">
<h2 id="org505ef30"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../SecSoftware">Software Development without Security
Holes</a>, 2019. Required Reading.</li>
</ol>
</div>
</div>

<div id="outline-container-org7ee6294" class="outline-2">
<h2 id="org7ee6294"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2019 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-09-18
</div>
</body>
</html>
